GHB2/src/Catalogs/гхб_Помещения/гхб_Помещения.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>гхб_Помещения</name>
  <hierarchical>true</hierarchical>
  <attributes>
    <name>УИДСинхронизации</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>36</length>
      </stringQualifiers>
    </type>
  </attributes>
</mdclass:Catalog>

GHB2/src/InformationRegisters/гхб_СвойстваПомещений/гхб_СвойстваПомещений.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>гхб_СвойстваПомещений</name>
  <informationRegisterPeriodicity>Second</informationRegisterPeriodicity>
  <writeMode>RecorderSubordinate</writeMode>
  <attributes>
    <name>Наименование</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>50</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>НаименованиеПолное</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>250</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Локация</name>
    <type>
      <types>CatalogRef.гхб_Помещения</types>
    </type>
  </attributes>
  <attributes>
    <name>Корпус</name>
    <type>
      <types>CatalogRef.гхб_Помещения</types>
    </type>
  </attributes>
  <attributes>
    <name>ЭлементСтроения</name>
    <type>
      <types>CatalogRef.гхб_Помещения</types>
    </type>
  </attributes>
  <attributes>
    <name>НомерПомещения</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ДробнаяЧасть</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Площадь</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ТипПомещения</name>
    <type>
      <types>CatalogRef.гхб_ТипыПомещений</types>
    </type>
  </attributes>
  <attributes>
    <name>ПлановоеКоличествоРабочихМест</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>НетРабочихМест</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>УточняющаяИнформация</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>150</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>НомерНаГенеральномПлане</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>10</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Закрыть</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ДоступВПомещениеПоКлючу</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>НаличиеОхраннойСигнализации</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ВнутреннийНомерКТ</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>150</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>НаличиеКТ</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>СогласованиеДоступаСВысшимРуководителем</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ОбщегоПользования</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <dimensions>
    <name>Помещение</name>
    <type>
      <types>CatalogRef.гхб_Помещения</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

GHB2/src/InformationRegisters/гхб_РуководителиЛокаций/гхб_РуководителиЛокаций.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>гхб_РуководителиЛокаций</name>
  <informationRegisterPeriodicity>Second</informationRegisterPeriodicity>
  <writeMode>RecorderSubordinate</writeMode>
  <resources>
    <name>Руководитель</name>
    <type>
      <types>CatalogRef.гхб_ФизическиеЛица</types>
    </type>
  </resources>
  <dimensions>
    <name>Локация</name>
    <type>
      <types>CatalogRef.гхб_Помещения</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

GHB2/src/InformationRegisters/гхб_ИспользованиеЛокацийДляЗакрепленияПарковочныхМест/гхб_ИспользованиеЛокацийДляЗакрепленияПарковочныхМест.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>гхб_ИспользованиеЛокацийДляЗакрепленияПарковочныхМест</name>
  <informationRegisterPeriodicity>Second</informationRegisterPeriodicity>
  <writeMode>RecorderSubordinate</writeMode>
  <attributes>
    <name>ИспользоватьДляЗакрепленияПарковочныхМест</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <dimensions>
    <name>Локация</name>
    <type>
      <types>CatalogRef.гхб_Помещения</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

GHB2/src/InformationRegisters/гхб_ОтветственныеЗаЛокации/гхб_ОтветственныеЗаЛокации.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>гхб_ОтветственныеЗаЛокации</name>
  <informationRegisterPeriodicity>Second</informationRegisterPeriodicity>
  <writeMode>RecorderSubordinate</writeMode>
  <attributes>
    <name>ОтветственныйЗаЛокацию</name>
    <type>
      <types>CatalogRef.гхб_ФизическиеЛица</types>
    </type>
  </attributes>
  <dimensions>
    <name>Локация</name>
    <type>
      <types>CatalogRef.гхб_Помещения</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

GHB2/src/InformationRegisters/гхб_ПлощадиПомещений/гхб_ПлощадиПомещений.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>гхб_ПлощадиПомещений</name>
  <attributes>
    <name>Площадь</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <dimensions>
    <name>Помещение</name>
    <type>
      <types>CatalogRef.гхб_Помещения</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

GHB2/src/Catalogs/гхб_ТипыПомещений/гхб_ТипыПомещений.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>гхб_ТипыПомещений</name>
  <predefined>
    <items>
      <name>ЭлементСтроения</name>
      <description>Елемент будівлі</description>
    </items>
    <items>
      <name>Корпус</name>
      <description>Корпус</description>
    </items>
    <items>
      <name>Локация</name>
      <description>Локація</description>
    </items>
  </predefined>
  <attributes>
    <name>ЭтоПомещение</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ИспользоватьДляКонсервацииПомещений</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
</mdclass:Catalog>

GHB2/src/Catalogs/Пользователи/Пользователи.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>Пользователи</name>
  <comment>АПК:413 - №744.2.1.1 Допустимо не отключать историю выбора, так как она используется, а переопределение отбора фиксированное, то есть служебные и недействительные пользователи в нее не попадут, но если как-то попали, то это не является проблемой</comment>
  <attributes>
    <name>Недействителен</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>Подразделение</name>
    <type>
      <types>DefinedType.Подразделение</types>
    </type>
  </attributes>
  <attributes>
    <name>ФизическоеЛицо</name>
    <type>
      <types>DefinedType.ФизическоеЛицо</types>
    </type>
  </attributes>
  <attributes>
    <name>Комментарий</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>Служебный</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>Подготовлен</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ИдентификаторПользователяИБ</name>
    <type>
      <types>UUID</types>
    </type>
  </attributes>
  <attributes>
    <name>ИдентификаторПользователяСервиса</name>
    <type>
      <types>UUID</types>
    </type>
  </attributes>
  <attributes>
    <name>СвойстваПользователяИБ</name>
    <type>
      <types>ValueStorage</types>
    </type>
  </attributes>
  <tabularSections>
    <name>ДополнительныеРеквизиты</name>
    <attributes>
      <name>Свойство</name>
      <type>
        <types>ChartOfCharacteristicTypesRef.ДополнительныеРеквизитыИСведения</types>
      </type>
    </attributes>
    <attributes>
      <name>Значение</name>
      <type>
        <types>Characteristic.ДополнительныеРеквизитыИСведения</types>
      </type>
    </attributes>
    <attributes>
      <name>ТекстоваяСтрока</name>
      <type>
        <types>String</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>КонтактнаяИнформация</name>
    <attributes>
      <name>Тип</name>
      <type>
        <types>EnumRef.ТипыКонтактнойИнформации</types>
      </type>
    </attributes>
    <attributes>
      <name>Вид</name>
      <type>
        <types>CatalogRef.ВидыКонтактнойИнформации</types>
      </type>
    </attributes>
    <attributes>
      <name>Представление</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>500</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ЗначенияПолей</name>
      <type>
        <types>String</types>
      </type>
    </attributes>
    <attributes>
      <name>Страна</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>100</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Регион</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>50</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Город</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>50</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>АдресЭП</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>100</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ДоменноеИмяСервера</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>100</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>НомерТелефона</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>20</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>НомерТелефонаБезКодов</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>20</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ВидДляСписка</name>
      <type>
        <types>CatalogRef.ВидыКонтактнойИнформации</types>
      </type>
    </attributes>
    <attributes>
      <name>Значение</name>
      <type>
        <types>String</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Catalog>

GHB2/src/Catalogs/гхб_Помещения/ManagerModule.bsl
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ПрограммныйИнтерфейс

Функция ВернутьДанныеПомещения(_Ссылка, _ДобавитьПоляНовые = Ложь) Экспорт 
	
	_Структура = Новый Структура();
	_Структура.Вставить("Родитель", Справочники.гхб_Помещения.ПустаяСсылка());
	_Структура.Вставить("Наименование", "");
	_Структура.Вставить("Руководитель", Справочники.гхб_ФизическиеЛица.ПустаяСсылка());
	_Структура.Вставить("ИспользоватьДляЗакрепленияПарковочныхМест", Ложь);
	_Структура.Вставить("ОтветственныйЗаЛокацию", Справочники.гхб_ФизическиеЛица.ПустаяСсылка());
	_Структура.Вставить("Локация", Справочники.гхб_Помещения.ПустаяСсылка());
	_Структура.Вставить("Корпус", Справочники.гхб_Помещения.ПустаяСсылка());
	_Структура.Вставить("ЭлементСтроения", Справочники.гхб_Помещения.ПустаяСсылка());
	_Структура.Вставить("Помещение", Справочники.гхб_Помещения.ПустаяСсылка());
	_Структура.Вставить("НомерПомещения", 0);
	_Структура.Вставить("ДробнаяЧасть", 0);
	_Структура.Вставить("Площадь", 0);
	_Структура.Вставить("ТипПомещения", Справочники.гхб_ТипыПомещений.ПустаяСсылка());
	_Структура.Вставить("ПлановоеКоличествоРабочихМест", 0);
	_Структура.Вставить("НетРабочихМест", Ложь);
	_Структура.Вставить("УточняющаяИнформация", "");
	_Структура.Вставить("НомерНаГенеральномПлане", "");
	_Структура.Вставить("Закрыть", Ложь);
	_Структура.Вставить("УИДСинхронизации", "");
	_Структура.Вставить("ЭтоПомещение", Ложь);
	_Структура.Вставить("ДоступВПомещениеПоКлючу", Ложь);
	_Структура.Вставить("НаличиеОхраннойСигнализации", Ложь);
	_Структура.Вставить("ВнутреннийНомерКТ", "");
	_Структура.Вставить("НаличиеКТ", Ложь);
	_Структура.Вставить("СогласованиеДоступаСВысшимРуководителем", Ложь);
	_Структура.Вставить("ОбщегоПользования", Ложь);
	
	Если _ДобавитьПоляНовые Тогда
		_Структура.Вставить("НаименованиеНовое", "");
		_Структура.Вставить("РуководительНовый", Справочники.гхб_ФизическиеЛица.ПустаяСсылка());
		_Структура.Вставить("ИспользоватьДляЗакрепленияПарковочныхМестНовое", Ложь);
		_Структура.Вставить("ЛокацияНовая", Справочники.гхб_Помещения.ПустаяСсылка());
		_Структура.Вставить("КорпусНовый", Справочники.гхб_Помещения.ПустаяСсылка());
		_Структура.Вставить("ЭлементСтроенияНовый", Справочники.гхб_Помещения.ПустаяСсылка());
		_Структура.Вставить("НомерПомещенияНовый", 0);
		_Структура.Вставить("ДробнаяЧастьНовая", 0);
		_Структура.Вставить("ПлощадьНовая", 0);
		_Структура.Вставить("ТипПомещенияНовый", Справочники.гхб_ТипыПомещений.ПустаяСсылка());
		_Структура.Вставить("ПлановоеКоличествоРабочихМестНовое", 0);
		_Структура.Вставить("НетРабочихМестНовое", Ложь);
		_Структура.Вставить("УточняющаяИнформацияНовая", "");
		_Структура.Вставить("НомерНаГенеральномПланеНовый", "");
		_Структура.Вставить("ЗакрытьНовое", Ложь);
		_Структура.Вставить("ДоступВПомещениеПоКлючуНовый", Ложь);
		_Структура.Вставить("НаличиеОхраннойСигнализацииНовое", Ложь);
		_Структура.Вставить("ВнутреннийНомерКТНовый", "");
		_Структура.Вставить("НаличиеКТНовое", Ложь);
		_Структура.Вставить("СогласованиеДоступаСВысшимРуководителемНовое", Ложь);
		_Структура.Вставить("ОбщегоПользованияНовый", Ложь);
	КонецЕсли;
	
	Если ЗначениеЗаполнено(_Ссылка) Тогда
		
		Запрос = Новый Запрос();
		Запрос.Текст = ВернутьТекстЗапросаСвойстваПомещений(Истина);
		
		Запрос.УстановитьПараметр("Помещение", _Ссылка);
		Выборка = Запрос.Выполнить().Выбрать();
		
		Если Выборка.Следующий() Тогда
			ЗаполнитьЗначенияСвойств(_Структура, Выборка);
		КонецЕсли;
		
	КонецЕсли;
	
	Возврат _Структура;
	
КонецФункции

Функция ВернутьТекстЗапросаСвойстваПомещений(_ЕдиничнаяСсылка = Истина) Экспорт
	
	_Текст  = "ВЫБРАТЬ
           |	гхб_СвойстваПомещенийСрезПоследних.Помещение КАК Помещение,
           |	гхб_СвойстваПомещенийСрезПоследних.Наименование КАК Наименование,
           |	гхб_СвойстваПомещенийСрезПоследних.Наименование КАК НаименованиеНовое,
           |	гхб_СвойстваПомещенийСрезПоследних.Локация КАК Локация,
           |	гхб_СвойстваПомещенийСрезПоследних.Локация КАК ЛокацияНовая,
           |	гхб_СвойстваПомещенийСрезПоследних.Корпус КАК Корпус,
           |	гхб_СвойстваПомещенийСрезПоследних.Корпус КАК КорпусНовый,
           |	гхб_СвойстваПомещенийСрезПоследних.ЭлементСтроения КАК ЭлементСтроения,
           |	гхб_СвойстваПомещенийСрезПоследних.ЭлементСтроения КАК ЭлементСтроенияНовый,
           |	ЕСТЬNULL(гхб_РуководителиЛокацийСрезПоследних.Руководитель, ЗНАЧЕНИЕ(Справочник.Пользователи.ПустаяСсылка)) КАК Руководитель,
           |	ЕСТЬNULL(гхб_РуководителиЛокацийСрезПоследних.Руководитель, ЗНАЧЕНИЕ(Справочник.Пользователи.ПустаяСсылка)) КАК РуководительНовый,
           |	ЕСТЬNULL(гхб_ИспользованиеЛокацийДляЗакрепленияПарковочныхМестСрезПоследних.ИспользоватьДляЗакрепленияПарковочныхМест, ЛОЖЬ) КАК ИспользоватьДляЗакрепленияПарковочныхМест,
           |	ЕСТЬNULL(гхб_ИспользованиеЛокацийДляЗакрепленияПарковочныхМестСрезПоследних.ИспользоватьДляЗакрепленияПарковочныхМест, ЛОЖЬ) КАК ИспользоватьДляЗакрепленияПарковочныхМестНовое,
           |	ЕСТЬNULL(гхб_ОтветственныеЗаЛокацииСрезПоследних.ОтветственныйЗаЛокацию, ЗНАЧЕНИЕ(Справочник.Пользователи.ПустаяСсылка)) КАК ОтветственныйЗаЛокацию,
           |	гхб_СвойстваПомещенийСрезПоследних.Закрыть КАК Закрыть,
           |	гхб_СвойстваПомещенийСрезПоследних.Закрыть КАК ЗакрытьНовое,
           |	гхб_СвойстваПомещенийСрезПоследних.НомерПомещения КАК НомерПомещения,
           |	гхб_СвойстваПомещенийСрезПоследних.НомерПомещения КАК НомерПомещенияНовый,
           |	гхб_СвойстваПомещенийСрезПоследних.ДробнаяЧасть КАК ДробнаяЧасть,
           |	гхб_СвойстваПомещенийСрезПоследних.ДробнаяЧасть КАК ДробнаяЧастьНовая,
           |	ЕСТЬNULL(гхб_ПлощадиПомещений.Площадь, гхб_СвойстваПомещенийСрезПоследних.Площадь) КАК Площадь,
           |	ЕСТЬNULL(гхб_ПлощадиПомещений.Площадь, гхб_СвойстваПомещенийСрезПоследних.Площадь) КАК ПлощадьНовая,
           |	гхб_СвойстваПомещенийСрезПоследних.ТипПомещения КАК ТипПомещения,
           |	гхб_СвойстваПомещенийСрезПоследних.ТипПомещения КАК ТипПомещенияНовый,
           |	гхб_СвойстваПомещенийСрезПоследних.ПлановоеКоличествоРабочихМест КАК ПлановоеКоличествоРабочихМест,
           |	гхб_СвойстваПомещенийСрезПоследних.ПлановоеКоличествоРабочихМест КАК ПлановоеКоличествоРабочихМестНовое,
           |	гхб_СвойстваПомещенийСрезПоследних.НетРабочихМест КАК НетРабочихМест,
           |	гхб_СвойстваПомещенийСрезПоследних.НетРабочихМест КАК НетРабочихМестНовое,
           |	гхб_СвойстваПомещенийСрезПоследних.УточняющаяИнформация КАК УточняющаяИнформация,
           |	гхб_СвойстваПомещенийСрезПоследних.УточняющаяИнформация КАК УточняющаяИнформацияНовая,
           |	гхб_СвойстваПомещенийСрезПоследних.НомерНаГенеральномПлане КАК НомерНаГенеральномПлане,
           |	гхб_СвойстваПомещенийСрезПоследних.НомерНаГенеральномПлане КАК НомерНаГенеральномПланеНовый,
           |	гхб_СвойстваПомещенийСрезПоследних.ДоступВПомещениеПоКлючу КАК ДоступВПомещениеПоКлючу,
           |	гхб_СвойстваПомещенийСрезПоследних.ДоступВПомещениеПоКлючу КАК ДоступВПомещениеПоКлючуНовый,
           |	гхб_СвойстваПомещенийСрезПоследних.НаличиеОхраннойСигнализации КАК НаличиеОхраннойСигнализации,
           |	гхб_СвойстваПомещенийСрезПоследних.НаличиеОхраннойСигнализации КАК НаличиеОхраннойСигнализацииНовое,
           |	гхб_СвойстваПомещенийСрезПоследних.ВнутреннийНомерКТ КАК ВнутреннийНомерКТ,
           |	гхб_СвойстваПомещенийСрезПоследних.ВнутреннийНомерКТ КАК ВнутреннийНомерКТНовый,
           |	гхб_СвойстваПомещенийСрезПоследних.НаличиеКТ КАК НаличиеКТ,
           |	гхб_СвойстваПомещенийСрезПоследних.НаличиеКТ КАК НаличиеКТНовое,
           |	гхб_СвойстваПомещенийСрезПоследних.СогласованиеДоступаСВысшимРуководителем КАК СогласованиеДоступаСВысшимРуководителем,
           |	гхб_СвойстваПомещенийСрезПоследних.СогласованиеДоступаСВысшимРуководителем КАК СогласованиеДоступаСВысшимРуководителемНовое,
           |	гхб_СвойстваПомещенийСрезПоследних.ОбщегоПользования КАК ОбщегоПользования,
           |	гхб_СвойстваПомещенийСрезПоследних.ОбщегоПользования КАК ОбщегоПользованияНовый,
           |	гхб_СвойстваПомещенийСрезПоследних.Помещение.УИДСинхронизации КАК УИДСинхронизации,
           |	гхб_СвойстваПомещенийСрезПоследних.Помещение.Родитель КАК Родитель,
           |	гхб_СвойстваПомещенийСрезПоследних.ТипПомещения.ЭтоПомещение КАК ЭтоПомещение
           |ИЗ
           |	РегистрСведений.гхб_СвойстваПомещений.СрезПоследних(, Помещение " + ?(_ЕдиничнаяСсылка, "= &Помещение", "В (&Помещение)") + ") КАК гхб_СвойстваПомещенийСрезПоследних
           |		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.гхб_РуководителиЛокаций.СрезПоследних(, Локация " + ?(_ЕдиничнаяСсылка, "= &Помещение", "В (&Помещение)") + ") КАК гхб_РуководителиЛокацийСрезПоследних
           |		ПО гхб_СвойстваПомещенийСрезПоследних.Помещение = гхб_РуководителиЛокацийСрезПоследних.Локация
           |		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.гхб_ИспользованиеЛокацийДляЗакрепленияПарковочныхМест.СрезПоследних(, Локация " + ?(_ЕдиничнаяСсылка, "= &Помещение", "В (&Помещение)") + ") КАК гхб_ИспользованиеЛокацийДляЗакрепленияПарковочныхМестСрезПоследних
           |		ПО гхб_СвойстваПомещенийСрезПоследних.Помещение = гхб_ИспользованиеЛокацийДляЗакрепленияПарковочныхМестСрезПоследних.Локация
           |		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.гхб_ОтветственныеЗаЛокации.СрезПоследних(, Локация " + ?(_ЕдиничнаяСсылка, "= &Помещение", "В (&Помещение)") + ") КАК гхб_ОтветственныеЗаЛокацииСрезПоследних
           |		ПО гхб_СвойстваПомещенийСрезПоследних.Помещение = гхб_ОтветственныеЗаЛокацииСрезПоследних.Локация
           |		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.гхб_ПлощадиПомещений КАК гхб_ПлощадиПомещений
           |		ПО гхб_СвойстваПомещенийСрезПоследних.Помещение = гхб_ПлощадиПомещений.Помещение";
	
	Возврат _Текст;
	
КонецФункции

Функция ВернутьПолноеНаименование(_Ссылка) Экспорт
	
	_Результат = "";
	
	Если ЗначениеЗаполнено(_Ссылка) Тогда
		
		Запрос = Новый Запрос();
		Запрос.Текст = "ВЫБРАТЬ
		               |	гхб_СвойстваПомещенийСрезПоследних.НаименованиеПолное КАК НаименованиеПолное
		               |ИЗ
		               |	РегистрСведений.гхб_СвойстваПомещений.СрезПоследних(, Помещение = &Помещение) КАК гхб_СвойстваПомещенийСрезПоследних";
		
		Запрос.УстановитьПараметр("Помещение", _Ссылка);
		Выборка = Запрос.Выполнить().Выбрать();
		
		_Результат = ?(Выборка.Следующий(), Выборка.НаименованиеПолное, "");
		
	КонецЕсли;
	
	Возврат _Результат;
	
КонецФункции

Функция ВернутьНаименованиеДляВыгрузкиВАД(_Ссылка) Экспорт
	
	_Результат = ВернутьПолноеНаименование(_Ссылка);
	
	_Позиция = СтрНайти(_Результат, "(");
	
	Если НЕ (_Позиция = 0) Тогда
		_Результат = СокрЛП(Лев(_Результат, _Позиция - 1));
	КонецЕсли;
	
	Возврат _Результат;
	
КонецФункции

Функция ВернутьАктивныеПомещенияПоТипу(_Тип) Экспорт 
	
	Запрос = Новый Запрос();
	Запрос.Текст = "ВЫБРАТЬ
	               |	гхб_СвойстваПомещенийСрезПоследних.Помещение КАК Помещение
	               |ИЗ
	               |	РегистрСведений.гхб_СвойстваПомещений.СрезПоследних КАК гхб_СвойстваПомещенийСрезПоследних
	               |ГДЕ
	               |	НЕ гхб_СвойстваПомещенийСрезПоследних.Закрыть
	               |	И гхб_СвойстваПомещенийСрезПоследних.ТипПомещения = &ТипПомещения";
	
	Запрос.УстановитьПараметр("ТипПомещения", _Тип);
	
	Возврат Запрос.Выполнить().Выгрузить().ВыгрузитьКолонку("Помещение");
	
КонецФункции

Процедура ОбработкаПолученияДанныхВыбора(ДанныеВыбора, Параметры, СтандартнаяОбработка)
	
	_УсловиеКонсервации = "";
	
	Если Параметры.Свойство("КонсервацияПомещений") Тогда
		
		_УсловиеКонсервации = " И " + ?(Параметры.КонсервацияПомещений, "", "НЕ ") + "гхб_СвойстваПомещенийСрезПоследних.ТипПомещения.ИспользоватьДляКонсервацииПомещений"
		
	КонецЕсли;
	
	Если Параметры.Свойство("ФильтрПоПомещениям") Тогда
		
		СтандартнаяОбработка = Ложь;
		
		Запрос = Новый Запрос;
		Запрос.УстановитьПараметр("СтрокаПоиска", ?(Параметры.СтрокаПоиска = Неопределено, "", Параметры.СтрокаПоиска) + "%");
		Запрос.УстановитьПараметр("СписокЛокаций", Параметры.ФильтрПоПомещениям);
		
		Запрос.Текст = "ВЫБРАТЬ ПЕРВЫЕ 50
		               |	гхб_Помещения.Ссылка КАК Ссылка
		               |ИЗ
		               |	Справочник.гхб_Помещения КАК гхб_Помещения
		               |		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.гхб_СвойстваПомещений.СрезПоследних КАК гхб_СвойстваПомещенийСрезПоследних
		               |		ПО гхб_Помещения.Ссылка = гхб_СвойстваПомещенийСрезПоследних.Помещение
		               |ГДЕ
		               |	гхб_Помещения.Ссылка В ИЕРАРХИИ(&СписокЛокаций)
		               |	И НЕ гхб_Помещения.ПометкаУдаления
		               |	И НЕ гхб_Помещения.ЭтоГруппа
		               |	И гхб_Помещения.Наименование ПОДОБНО &СтрокаПоиска
		               |	И НЕ гхб_СвойстваПомещенийСрезПоследних.Закрыть
					   |	" + _УсловиеКонсервации + "
		               |
		               |УПОРЯДОЧИТЬ ПО
		               |	гхб_Помещения.Наименование";
		
		ДанныеВыбора = Новый СписокЗначений;
		ДанныеВыбора.ЗагрузитьЗначения(Запрос.Выполнить().Выгрузить().ВыгрузитьКолонку("Ссылка"));
		
	КонецЕсли;
	
КонецПроцедуры

Функция ВернутьПомещениеПоИдентификатору(_УИД) Экспорт 
	
	Если ЗначениеЗаполнено(_УИД) Тогда
	
		_Помещение = Справочники.гхб_Помещения.НайтиПоРеквизиту("УИДСинхронизации", _УИД);
		
		Если НЕ ЗначениеЗаполнено(_Помещение) Тогда
			_Помещение = Справочники.гхб_Помещения.ПолучитьСсылку(Новый УникальныйИдентификатор(_УИД));
		КонецЕсли;
		
	Иначе 
		
		_Помещение = Справочники.гхб_Помещения.ПустаяСсылка();
		
	КонецЕсли;
	
	Возврат _Помещение;
	
КонецФункции

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

#КонецОбласти

#КонецЕсли
